{"id": 1, "final_score": 9.5, "question": "A nucleus with atomic number $Z$ and mass number $A$ has a uniform charge density within a sphere of radius $R = r_0 A^{1/3}$. An electron (mass $m_e$) and a muon (mass $m_\\mu = 207 m_e$) are separately bound in the $1s$ state of this atom. Using first-order perturbation theory with the unperturbed hydrogen-like wavefunctions for a point nucleus, compute the ratio of the energy shifts due to the finite nuclear size, $\\frac{\\Delta E_\\mu}{\\Delta E_e}$, and express it in terms of $Z$, $A$, $r_0$, $m_e$, $m_\\mu$, and fundamental constants, simplified to a closed-form expression.", "problem_draft": "An atom consists of a nucleus of charge $+Ze$ and mass number $A$, surrounded by a single electron. The nucleus is not point-like; instead, it has a uniform charge distribution within a sphere of radius $R = r_0 A^{1/3}$, where $r_0$ is a constant. The electron is bound in a hydrogen-like state with principal quantum number $n$. Consider the perturbation to the electron's energy levels due to the finite size of the nucleus, assuming that the unperturbed wavefunctions are those of a point nucleus.\n\n(a) Show that the energy shift for the $1s$ state (ground state) is approximately proportional to $A^{2/3}$ for large $A$.\n\n(b) For the $2s$ state, derive an expression for the energy shift and compare its magnitude to that of the $1s$ state for the same nucleus.\n\n(c) Discuss why the finite size effect is more significant for muonic atoms and estimate the ratio of the $1s$ finite size shift in a muonic atom to that in an electronic atom for the same nucleus.", "element_idendified": "The problem involves quantum mechanical perturbation theory applied to atomic physics. Key elements:\n1. Nuclear charge distribution: uniform sphere of radius $R = r_0 A^{1/3}$.\n2. Unperturbed wavefunctions: hydrogen-like for point nucleus.\n3. Perturbation: difference between the actual potential and Coulomb potential.\n4. Energy shift calculation for $1s$ and $2s$ states.\n5. Comparison between $1s$ and $2s$ shifts.\n6. Application to muonic atoms: electron replaced by muon.\n\nVariables to manipulate: nuclear size parameter $R$, quantum numbers, atomic number $Z$, mass number $A$, and lepton mass (for muonic case).", "plan": "To increase complexity and transform into a single answer problem:\n1. Combine parts (a), (b), (c) into one unified calculation.\n2. Focus on a specific state: compute the energy shift for the $2p$ state instead of $2s$ to add complexity (since $2p$ has angular dependence).\n3. For muonic atoms, introduce the exact mass dependence.\n4. Require the ratio of finite size shifts for $1s$ state in muonic vs electronic atoms for a given nucleus, but make it depend on $Z$ and $A$.\n5. Add a constraint: express the shift in terms of fundamental constants and require a closed-form expression.\n\nModified problem: Calculate the ratio of the finite nuclear size energy shift for the $1s$ state in a muonic atom to that in an electronic atom, for a nucleus with atomic number $Z$ and mass number $A$. Express your answer in terms of $Z$, $A$, $r_0$, and fundamental constants, and simplify.", "rewritten_problem": "A nucleus with atomic number $Z$ and mass number $A$ has a uniform charge density within a sphere of radius $R = r_0 A^{1/3}$, where $r_0$ is a constant. An electron bound in the $1s$ state experiences an energy shift $\\Delta E_e$ due to the finite nuclear size. Similarly, a muon (with mass $m_\\mu = 207 m_e$) bound in the $1s$ state experiences a shift $\\Delta E_\\mu$. Using first-order perturbation theory and the unperturbed hydrogen-like wavefunctions for a point nucleus, find the ratio $\\frac{\\Delta E_\\mu}{\\Delta E_e}$ in closed form."}
{"id": 2, "final_score": 8.5, "question": "A thin converging lens has focal length $f$ in air and is made of a material with refractive index $n_l$. The lens is submerged at a depth $d$ below the calm water surface of refractive index $n$. A point light source is located in air at a height $h$ directly above the lens on the optical axis. Find the depth below the water surface of the image formed by the system consisting of the air-water interface and the lens. Assume $d > \\frac{h}{n}$. Express your answer in terms of $f$, $n$, $n_l$, $d$, $h$.", "problem_draft": "A thin converging lens of focal length $f$ is placed at the bottom of a deep pool filled with water of refractive index $n$. The lens is submerged and horizontal. A small light source is placed in air directly above the lens at a height $h$ above the water surface. The water surface is flat and calm. Find the position of the image formed by the lens system, considering refraction at the water-air interface and the lens. Express your answer in terms of $f$, $n$, $h$, and physical constants as needed.", "element_idendified": "Key elements: refractive index n (water), focal length f (lens in water), height h (light source above water). The process involves refraction at air-water interface and then by the lens. The lens is submerged, so its focal length in water is different from what it would be in air. The interface acts as a spherical surface (flat actually) causing refraction. The light source is in air, so first refracts at interface, then hits the lens, then refracts again at interface after lens? But the problem states the lens is at the bottom and the source is above, so light goes air -> water -> lens -> water -> air? But the image is formed somewhere, probably in air. However, the problem asks for the image formed by the lens system, meaning after all refractions. But note: the lens is at the bottom, so after the lens, the light might hit the water-air interface again? This is complex. Let me clarify: the light source is in air at height h above water. Water depth is not given, but since lens is at bottom, we assume the pool is deep, but we need the distance from interface to lens. The problem doesn't specify the depth of water. This is a flaw. So I must assume the depth d from water surface to lens is given? But it's not. The problem draft is ambiguous. Alternatively, the lens is at the bottom but we don't know d. How to fix? Perhaps assume that the lens is very close to the interface? But that might not be the case. Another idea: the lens is submerged, but we are to find image, so d (depth to lens) must be a parameter? But the problem doesn't have it. So I need to add a parameter. Alternatively, in the rewritten problem, I can set the lens at a depth d below the surface. So let me adjust: add depth d. Also, the light after lens may go back to air? But the problem says \"the image formed by the lens system\", so we must consider the entire path. However, to make it solvable and closed-form, we might consider only the first refraction and the lens, and then the image is formed in water? But the source is in air, and we want the final image in air? This might require multiple refractions. To simplify for an olympiad problem, we can assume that after the lens, the light rays are converging and hit the water-air interface, refracting again. But that would require solving for refraction at a plane surface twice. This can be done with ray transfer matrices? But for closed form, we can use the formula for refraction at a plane interface. So let's restructure the problem to make it unambiguous and solvable. The lens is at depth d below the water surface. The light source is in air at height h above the water surface. So the object distance from the interface is h (in air). First, refraction at air-water interface: the object in air at distance h. Then the image formed by the interface is at a distance h' = h / n below the interface (since flat surface, refraction from air to water). Then this image acts as an object for the lens. The lens is at depth d, so the object distance for the lens is (d - h')? But h' = h/n, and d is depth, so if d > h', then object distance is d - h'. Then the lens forms an image at some point in water. Then that image acts as an object for the refraction back at the water-air interface. So we have three refractions. This might be too messy for a single answer. Alternatively, we can use the concept of effective focal length or ray matrices. But the problem should be analytical. Another idea: place the lens at the water surface? But the problem says at the bottom. Perhaps assume the lens is just below the surface? Then d=0. But that changes the problem. To make it challenging and require both math and physics, I propose the following rewritten problem: a lens of focal length f (in air) is placed at a depth d below the water surface. The light source is at height h above the water surface. Find the position of the final image relative to the water surface, after refraction at the interface and the lens, and then again at the interface. But this has three steps. We can combine. Step 1: refraction at air-water interface: object distance u1 = h (in air), refractive indices n1=1, n2=n, so for flat surface, v1 = (n2/n1) u1 = n h (distance in water). But sign: if object is real, in air, then the image is virtual in water at distance h/n above the interface? Standard formula: for a plane surface, the apparent depth. If an object is in water at depth d, it appears at d/n in air. But here, object in air at height h, so when viewed from water, it appears at h/n above the interface? Actually, the light is coming from air to water. So for an object in air, the image in water is virtual and on the same side? Let's think: an object in air, light rays coming to water. The rays bend away from normal? So the image is closer to the surface? Actually, for an object in air, when viewed from water, it appears higher. Standard formula: the object distance u in air, then the image distance v in water satisfies (n2/v) - (n1/u) = 0 for plane surface? Actually, the formula for refraction at a plane surface is n1 / u = n2 / v, with signs. By convention, u is negative if object is on the incident side? I need a consistent sign convention. To avoid confusion, in the rewritten problem, I will use the standard Cartesian sign convention. But for simplicity, we can use magnitudes and specify. Alternatively, in the rewritten problem, we can consider only one refraction and the lens, and the image is formed in water. Then we don't have the second refraction. But the problem draft says \"the image formed by the lens system\", and the system includes the interface and the lens. So if we define the system as air-water interface and then the lens, the image is in water. But then why is the source in air? It might be fine. Let me try: the lens is submerged at depth d below water surface. Object in air at height h above water. Refraction at air-water interface: object in air at distance h above, so for water side, the object appears at a distance h/n below the interface (virtual object for water? No. Actually, the rays after refraction seem to come from a point at distance h/n below the interface in water. So the effective object distance for the lens is d + h/n (since lens is at depth d). Then the lens equation: 1/v - 1/u = 1/f_w, but f_w is the focal length in water. The lens has focal length f in air. When submerged in water, its focal length becomes f_w = f * (n - 1) / (n / n_water - 1) * n_water? Standard formula: the focal length in a medium is f_m = f_air * (n_lens - 1) / (n_lens / n_m - 1) * n_m / (n_air) but n_air=1. So f_w = f * (n_lens - 1) / (n_lens / n - 1) * n. But what is n_lens? The refractive index of the lens material is not given. The problem draft didn't specify. This is another flaw. So in the rewritten problem, I must specify the refractive index of the lens material. Let's call it n_l. Then f in air is given, so in water, f_w = f * (n_l - 1) / (n_l / n - 1) * n. Alternatively, to avoid that, we can assume the lens is thin and its focal length in water is given as f. But the problem draft says \"focal length f\", without specifying in which medium. Probably, f is the focal length in water? But the problem says \"a thin converging lens of focal length f\", and it's submerged, so logically f should be its focal length in water. But to be clear, in the rewritten problem, I will state: \"a thin converging lens with focal length f in water\". Then we don't need n_l. So for Task 1, the draft is ambiguous. For Task 2, I will rewrite to remove ambiguities. Let's specify: the lens has focal length f in water. The water depth is d. The light source is at height h above water. After refraction at air-water interface, the object appears at h/n below the surface. So object distance for lens is u = d + h/n (since both in water). Then lens equation: 1/v = 1/u + 1/f. Then v is the image distance from lens in water. Then the final image is located at distance v below the lens, so from water surface, it is d + v. But this image is in water. The problem might want the position relative to water surface. And since it's in water, no further refraction. So the answer would be d + v. But the problem draft mentioned \"the lens system\" including the interface and the lens, so this might be acceptable. However, the original draft didn't have depth d, so we must include d as a parameter. Also, we need the entire expression. So let me try to write the problem. But the problem should test math and physics skills. Math skill: solving equations, algebra. Physics: optics, refraction, lens. But to make it more challenging and require both, we can add complexity. Step 2: plan to increment complexity. Original elements: n, f, h, d. Conditions: light source in air, lens in water at depth d. We can add that the lens is not on the axis? But that might be too much. Or we can add a second medium? But that might not be necessary. We can make the light source not on the axis? But the problem says \"directly above\", so on axis. We can require the magnification or something. But the draft asks for position. Another idea: instead of a point source, make it an extended object? But then it might require the image size, but the problem asks for position. To increase complexity, we can consider that after the lens, the light refracts again at the water-air interface. So the image we just found in water acts as an object for the interface. Then we have to find where the final image is in air. But then we have to know where the rays are going after the lens. If the image from the lens is real and in water, then it is an object for the interface. If the object is in water, distance w below interface, then the image in air is at w*n above the interface? Apparent depth. But that would be if the rays are diverging. Actually, when we have a real image in water, the rays are converging to that point. When they hit the interface, they refract and converge to a different point. This is trickier. The formula for refraction at a plane interface for a converging beam. For a point object in water at distance u below interface, the image distance in air is v = u / n. But that's for a real object, i.e., diverging rays. For a virtual object or converging rays, the formula is different. Specifically, if the object is real, u positive (in water), n1=n, n2=1, then the image distance v in air satisfies n/u = 1/v, so v = u/n. But if the object is virtual (converging rays), u is negative, then v = u/n, which would be negative, meaning virtual in water. But in our case, after the lens, we have a real image in water, so it's a real object for the interface, so the final image is at v = u / n in air, where u is the distance from interface to the object. But since the object is at depth (d + v) from surface, and v is from lens, so u = d + v, then final image distance from surface is (d + v)/n. But only if the rays are diverging from the object. But when the lens forms a real image, rays are converging to that point. So for the interface, the rays are converging to a point at depth u = d + v below surface. So from the water side, it is a real object at distance u. Then for refraction from water to air, the object distance is u, the image distance v' satisfies n/u = 1/v', so v' = u / n = (d + v)/n. This v' is the distance from the interface in air. And since the object is real, v' is positive, meaning the image is real in air. So the final image is at height v' above the water surface? No: if v' is positive, and the object is below, then the image is on the same side? Standard formula: for a plane interface, when light goes from water to air, and object is in water, the image is in air on the same side. So if object is at distance u below interface, image is at distance v' above the interface? No. Apparent depth: when you look from air, an object in water appears closer. So for an object at depth u in water, it appears at v' = u / n below the surface in air. But that is the virtual image position. Actually, the image is virtual in water? I'm confusing. Let's think physically: rays coming from an object in water, after refraction at interface, diverge as if coming from a point closer to the surface. So the virtual image is at depth u/n in water. But for the interface, the image is on the same side as the object. In terms of ray transfer, for a real object in water, the image formed by the interface is virtual and at u/n in water. But then the rays are in air, and they appear to come from a point at depth u/n in water. But for our purpose, the final image that is formed is the point where the rays actually converge. In this case, after the lens, we have converging rays to a point in water. When these rays hit the interface, they refract and may converge to a different point in air. The formula for the shift due to a plane interface for a converging beam. The general formula: if a converging beam is incident on a plane interface, the point of convergence is shifted. In particular, if the convergence point is at distance s from the interface in medium 1, after refraction into medium 2, the new convergence point is at distance s * (n2/n1) from the interface in medium 2? I think yes, for paraxial rays. Because the rays are focused at s, so the wavefront is spherical, and after refraction, it's still spherical but with different curvature. So the focal point moves to s * (n2/n1). In this case, from water to air, n1=n, n2=1, so if the focus in water is at distance s below interface, then in air it is at s * (1/n) above the interface? Let's see the sign. If s is positive (below), then in air, the focus is at s/n above the interface. But above the interface is negative distance? We need sign convention. Define: let the interface be at z=0, water for z<0, air for z>0. If the focus in water is at z = -s (s>0), then after refraction to air, the focus in air is at z = - (s/n). No. From the formula, the apparent depth is s/n for an object at depth s, but that is for diverging rays. For converging rays, it should be similar. In fact, the ray transfer matrix for a plane interface is [1, 0; 0, n1/n2] for from medium 1 to 2. For a ray with height y and angle θ, after refraction, θ' = (n1/n2) θ. For a ray converging to a point at distance s to the left of the interface (in medium 1), the angle θ = y / s. After refraction, in medium 2, the angle θ' = (n1/n2) θ = (n1/n2) y / s. But in medium 2, if the focus is at distance s' to the right, then θ' = - y / s' (since converging). So -y/s' = (n1/n2) y / s ⇒ 1/s' = - (n1/n2) / s. So s' = - (n2 / n1) s. This means the focus is at distance s' = (n2 / n1) s to the right, but since s is distance to the left, the actual position is s' = - (n2 / n1) s relative to the interface? If we define position, the focus in medium 1 is at z = -s (s>0), then after refraction, the focus in medium 2 is at z = + (n2/n1) s? From the ray matrix, for a ray with initial conditions at interface, y and θ, after refraction, y' = y, θ' = (n1/n2) θ. If the ray in medium 1 is converging to a point at z = -s, so when it hits the interface at height y, the slope θ = y / s (since from z=0 to z=-s, distance s). After refraction, θ' = (n1/n2) (y/s). In medium 2, the ray has slope θ', so it will intersect the axis at z = - y / θ' = - y / [ (n1/n2) y / s ] = - (n2 / n1) s. So z = - (n2 / n1) s. But in our coordinate, z is positive in air, so if n2=1, n1=n, then z = - (1/n) s. But s is the distance in water, so if the focus was at z = -s, now it's at z = -s/n. Which is still in water? And virtual. But physically, when converging rays in water hit the interface, they may not converge in air if s is small. This is messy. To avoid this complexity, and since the problem draft didn't specify, I will in the rewritten problem assume that the image is formed in water and we report its depth. Or, to make it simpler, assume that the water depth is infinite or that we only care about the image formed in water. But the draft said \"the image formed by the lens system\", so for system of interface and lens, the image is in water. So for the rewritten problem, I will do that. So the problem is: A thin converging lens with focal length f in water is submerged at a depth d below the calm water surface of refractive index n. A point light source is located in air at a height h directly above the lens. Find the depth of the image formed by the system below the water surface, in terms of f, n, d, h. Then the solution is: First, refraction at air-water interface: object at height h in air, so apparent depth in water is h/n below surface. So the object distance for the lens is u = d + h/n (since both in water, and lens is below). Lens equation: 1/v = 1/f - 1/u? Sign convention: let's use real is positive. Object is on the side from which light is coming, so if light is coming from above, object is to the left, u positive. For a converging lens, f positive. So 1/v + 1/u = 1/f? Standard lens equation: 1/v - 1/u = 1/f, with u negative if object on the left. To avoid confusion, let's define: let the lens be the origin. Light is coming from above, so object is above the lens. In the water, after refraction, the object is at a point above the lens? The interface is above, lens at depth d. After refraction, the virtual object is at depth h/n below surface. Lens is at depth d. So if d > h/n, the object is between surface and lens, so it is above the lens. So object distance u = depth of lens minus depth of object = d - (h/n). Depth of object is distance from surface: h/n below surface. Lens is d below surface. So object depth = h/n, lens depth = d, so distance between them is d - h/n. And since the object is above the lens, and light is coming down, u = d - h/n. Then lens equation: for a converging lens, 1/v = 1/f + 1/u? If object is real, u positive, then 1/v = 1/f - 1/u? Standard: 1/f = 1/v - 1/u, with u negative for object on the incident side. I am using the convention where object distance u is negative if on the incident side. To make it simple, use magnitudes. Let u be the magnitude of the object distance. For the lens, if the object is on the same side as the incoming light, u is positive for the distance. Then for a converging lens, 1/f = 1/v - 1/u, with v positive if image on the other side. In this case, light is coming from above, so incident side is above. Object is above the lens, so u = d - h/n. Then 1/v = 1/f + 1/u? No. Standard formula: 1/f = 1/v - 1/u, with u positive for real object. So if object is real, u>0, f>0 for converging, then v = 1/(1/f + 1/u) if we have 1/v = 1/f + 1/u? Let me write: 1/f = 1/v - 1/u. So if u is positive, 1/v = 1/f + 1/u, so v is positive, image on the opposite side, below the lens. Then the image distance is v below the lens. Then the depth from surface is d + v. So the final answer is d + v, with v = 1 / (1/f + 1/u), u = d - h/n. But only if d > h/n, otherwise the object might be virtual. So we must have d > h/n for a real object. Otherwise, if d < h/n, the object is virtual below the lens. But to keep it simple, we can assume d > h/n. Or we can write generally. But for the problem, we can state it. Now to make it more challenging, we can add that there is a mirror or something, but that might be too much. Or we can make the light source at infinity? But then it's trivial. Another idea: the water surface is not flat? But that would be too hard. Or add a prism. But let's stick to this. For Step 2, plan to increment complexity. I will add a parameter: the lens is made of a material with refractive index n_l, and f is its focal length in air. Then in water, f_w = f * (n_l - 1) / (n_l - n) * n, or something. Standard formula: the focal length in a medium is f_m = f_air * [ (n_l - n_m) / (n_l - 1) ] * [ n_m / n_l ] ? Let's recall: the lensmaker's formula: 1/f = (n_l/n_m - 1) (1/R1 - 1/R2) in medium. In air, n_m=1, so 1/f_air = (n_l - 1) (1/R1 - 1/R2). In water, 1/f_w = (n_l/n - 1) (1/R1 - 1/R2) = [ (n_l - n)/n ] (1/R1 - 1/R2) = (n_l - n)/(n (n_l - 1)) * (n_l - 1) (1/R1 - 1/R2) = (n_l - n)/(n (n_l - 1)) * 1/f_air. So f_w = f_air * [ n (n_l - 1) / (n_l - n) ] So we have f_w in terms of f_air, n_l, n. But this introduces n_l. To have a closed-form answer, we can keep it. Or assume n_l is given. For the problem, we can give a specific n_l, like glass, n_l=1.5. But the answer should be in terms of symbols. To reduce parameters, we can define the focal length in water as f, and not introduce n_l. That's better for the draft. So in the rewritten problem, we'll assume the lens has focal length f in water. So no n_l. Then we have parameters: n, f, d, h. Answer: depth = d + v, with v = 1 / (1/f + 1/u), u = d - h/n. But v can be negative if the image is virtual. But in closed form: v = 1 / (1/f + 1/(d - h/n)) Then depth = d + 1 / (1/f + 1/(d - h/n)) = d + 1 / ( (u + f) / (u f) ) = d + u f / (u + f) = d + (d - h/n) f / (d - h/n + f) So depth = d + f (d - h/n) / (f + d - h/n) This is a closed-form expression. We can write it as a single fraction. Depth = [ d (f + d - h/n) + f (d - h/n) ] / (f + d - h/n) = [ d f + d^2 - d h/n + f d - f h/n ] / (f + d - h/n) = [ d^2 + 2 d f - (d + f) h/n ] / (f + d - h/n) This is messy. Depth = d + \frac{ f (d - h/n) }{ f + d - h/n } But it's closed form. To make it more challenging, we can add that the water has a layer of oil or something, but that might be too much. Or make the surface curved. But for simplicity, we'll keep it. So for Task 2, the rewritten problem will be: A thin converging lens with focal length f in water is submerged at a depth d below the calm water surface of refractive index n. A point light source is located in air at a height h directly above the lens on the optical axis. Find the depth below the water surface of the image formed by the system consisting of the air-water interface and the lens. Assume d > h/n. Express your answer in terms of f, n, d, h. Then the answer is: depth = d + \frac{ f (d - \frac{h}{n}) }{ f + d - \frac{h}{n} } We can write it as depth = \frac{ d(f + d - \frac{h}{n}) + f(d - \frac{h}{n}) }{ f + d - \frac{h}{n} } or simplify. But it's fine. Now for Step 4, review. Clarity: the problem is clear. Uniqueness: with the assumption d>h/n, the object is real, and the image is real if v>0, which it should be for converging lens. But if f is very small, it might be virtual, but we can assume parameters are such that image is real, or allow virtual image. In the expression, if u is positive, v = u f / (u - f) for converging lens? From 1/v = 1/f - 1/u? Earlier I had 1/v = 1/f + 1/u? Let's correct. Standard lens formula: for converging lens, 1/v - 1/u = 1/f, with u negative if object is on the incident side. To avoid confusion, let's use the formula with magnitudes. Define u as the object distance magnitude. For a converging lens, if the object is on the left, real, u>0, then 1/v = 1/f - 1/u. So v = u f / (u - f). So if u > f, v>0, real image on the right. In our case, u = d - h/n. So v = (d - h/n) f / (d - h/n - f) Then depth = d + v = d + \frac{ f (d - h/n) }{ d - h/n - f } This is different from earlier. I think I had a sign error. In the lens equation, with u positive for object distance, v positive for image distance on the other side, 1/f = 1/u + 1/v for converging lens? No, 1/f = 1/v - 1/u with u negative for incident side. Let me use a consistent convention. Set the lens at z=0, light coming from left to right. Object is on the left, so u is negative. Let u be the object position. Object is at position -u, u>0, so object distance is -u. Lens equation: 1/v - 1/( -u) = 1/f, so 1/v + 1/u = 1/f. So v = 1 / (1/f - 1/u) = u f / (u - f) for u > f. Then image is at v to the right of lens. In our case, the lens is at depth d below surface. The object is at depth h/n below surface. Since h/n < d (by assumption), object is at depth h/n, lens at d, so from lens, object is at distance u = d - h/n above the lens. In the coordinate with lens at 0, down positive, then object is at position - (d - h/n) if we set up increasing down. To simplify, let's set the water surface at z=0, down positive. So surface at z=0, lens at z=d. Object after refraction is at z = h/n. So object position z_o = h/n. Lens at z_l = d. Light is coming from above, so for the lens, the object is to the left (above) in the ray direction. So object distance u = z_l - z_o = d - h/n >0. Since the object is on the incident side, and we are using u as the distance from object to lens, with light coming from object to lens, u is positive. For a converging lens, the lens equation is: 1/f = 1/v - 1/u, where v is the image distance from lens, positive if on the opposite side. So 1/v = 1/f + 1/u. So v = 1 / (1/f + 1/u) = u f / (u + f) Then since v>0, image is below the lens at distance v. So depth from surface is z_l + v = d + v = d + \frac{ u f }{ u + f } = d + \frac{ f (d - h/n) }{ d - h/n + f } So my first version was correct for this convention. 1/v = 1/f + 1/u, so v = u f / (u + f) Now, for the image to be real, v>0, which is true since u>0, f>0. So no issue. Depth = d + \frac{ f (d - \frac{h}{n}) }{ f + d - \frac{h}{n} } Now for the rewritten problem. In Step 2, to increment complexity, I can add a constraint or another element. For example, add that the water has a current or something, but that might not be physical. Or make the light monochromatic and consider interference, but that's too much. Or add a second lens. But to keep within 30 words, perhaps not. Another idea: the light source is not on the axis, but at a lateral distance, but then the image position would be a point, and the answer might be a coordinate, but it's messy. Or require the magnification. But the draft asks for position. So I'll proceed with this. Plan: modify by adding that the lens is not thin, but that might be too vague. Or specify that the focal length is for paraxial rays. But it's assumed. Or add a wavelength and consider dispersion, but that would require multiple answers. To make it more mathematical, we can have the depth d related to h or something. But in the expression, it's already there. Or make d and h related by a condition. But for now, I'll keep it. So for Step 3, the rewritten problem is: ", "plan": "To increase complexity and integrate more physics and math, modify the problem by: (1) Adding that the lens is made of a material with refractive index n_l, and f is its focal length in air, so we need to compute its focal length in water using the lensmaker's formula. (2) Instead of a point source, make it an extended object at height h with size s, and find the size of the image. (3) Add a constraint that the final image is at a specific position, and solve for one parameter. However, to keep a single answer and closed-form, I choose to implement only (1) and keep the point source. Also, to make the math more involved, have the light refract back to air, so the final image is in air, requiring three refractions. But that might be too long. Instead, I will add that after forming the image in water, there is a mirror at the bottom, reflecting the light back, and then it refracts at the interface again. But that might be complex. To balance, I will stick to the current system but with the lens focal length in air given, and n_l given. So elements to modify: introduce n_l, the refractive index of the lens material. Then f_w = f * [ n (n_l - 1) / (n_l - n) ] where f is focal length in air. Then use f_w in the lens equation. This adds one parameter and makes the expression more complex mathematically. Also, the depth expression has more terms. So #Rewritten_Problem#: ", "rewritten_problem": "A thin converging lens is made of glass with refractive index $n_l = 1.5$. Its focal length in air is $f$. The lens is submerged at a depth $d$ below the calm water surface of refractive index $n = 4/3$. A point light source is located in air at a height $h$ directly above the lens on the optical axis. Find the depth below the water surface of the image formed by the system consisting of the air-water interface and the lens. Assume $d > h/n$. Express your answer in terms of $f$, $n$, $n_l$, $d$, $h$."}
{"id": 3, "final_score": 8.5, "question": "A quantum harmonic oscillator with mass $m$ and frequency $\\omega$ is prepared in its ground state at $t=0$. At that instant, a time-dependent electric field $E(t) = E_0 e^{-\\alpha t}$ ($t \\geq 0$, $\\alpha > 0$) is applied, coupling to the position via $V(t) = -e E(t) x$. Using the Ehrenfest theorem, derive the exact expression for the expectation value $\\langle x \\rangle(t)$ for $t>0$.", "problem_draft": "Consider a quantum harmonic oscillator with Hamiltonian $H = \\frac{p^2}{2m} + \\frac{1}{2} m \\omega^2 x^2$. An electron is prepared in the ground state, $|0\\rangle$, at time $t=0$. A uniform electric field $E$ is suddenly turned on at $t=0$ and remains constant thereafter, adding a perturbation $V = -e E x$. Using the Ehrenfest theorem, determine the expectation value $\\langle x \\rangle$ as a function of time for $t>0$. Proceed to find the exact wave function at time $t$ and verify your result for $\\langle x \\rangle$.", "element_idendified": "Key elements: quantum harmonic oscillator, ground state, perturbation by uniform electric field, Ehrenfest theorem, expectation value of position. Core concept: time evolution of expectation values under a perturbation. Variables: time $t$, position $x$, mass $m$, frequency $\\omega$, electric field $E$, electron charge $e$. Conditions: sudden turn-on of field at $t=0$, constant thereafter.", "plan": "The problem draft is a calculation and verification question. To rewrite it as a difficult calculation question with a single answer: \n1. Remove the verification part to focus solely on calculation. \n2. Increase complexity by adding a constraint: the electric field is time-dependent, specifically $E(t) = E_0 e^{-\\alpha t}$ for $t \\geq 0$ with $\\alpha > 0$, requiring solving for $\\langle x \\rangle(t)$ with exponential decay. \n3. Combine Ehrenfest theorem with the new time-dependent perturbation. \n4. Ensure the solution must be in closed form. \n5. Maintain that the system starts in ground state of unperturbed oscillator. \n6. The final answer should be a single expression for $\\langle x \\rangle(t)$.", "rewritten_problem": "A quantum harmonic oscillator has Hamiltonian $H_0 = \\frac{p^2}{2m} + \\frac{1}{2} m \\omega^2 x^2$. At time $t=0$, it is in the ground state $|0\\rangle$. A time-dependent electric field is applied, giving a perturbation $V(t) = -e E(t) x$, where $E(t) = E_0 e^{-\\alpha t}$ for $t \\geq 0$ and $\\alpha > 0$. Using the Ehrenfest theorem, find the expectation value $\\langle x \\rangle(t)$ for $t>0$. Express your answer in closed form."}
{"id": 4, "final_score": 8.0, "question": "A particle of mass $m$ and charge $q > 0$ is projected from the origin with initial velocity $\\mathbf{v} = (v_0, 0, 0)$ into a region with uniform magnetic field $\\mathbf{B} = (0, 0, B)$ and electric field $\\mathbf{E} = (0, E_0 (1 + \\alpha y^2), 0)$, where $\\alpha > 0$. The particle returns to the $xy$-plane at time $T = \\frac{2\\pi m}{qB}$. Determine the ratio $\\frac{x}{y}$ at time $t = \\frac{T}{2}$, given that $\\alpha m v_0^2 = q E_0$.", "problem_draft": "A particle of mass $m$ and charge $q$ is projected with velocity $\\mathbf{v} = (v_0, 0, 0)$ from the origin in a region with a uniform magnetic field $\\mathbf{B} = (0, 0, B)$ and a uniform electric field $\\mathbf{E} = (0, E, 0)$. Find the position of the particle at time $t = \\frac{2\\pi m}{qB}$.\n\n", "element_idendified": "Key elements: particle properties (mass, charge), initial conditions (position, velocity), fields (uniform magnetic and electric), specific time. Variables: position components at given time. Conditions: fields are uniform and orthogonal. Core: motion in crossed fields.", "plan": "Increase complexity by making the electric field non-uniform but symmetric. Specifically, let the electric field be $\\mathbf{E} = (0, E_0 (1 + \\alpha y^2), 0)$, where $\\alpha$ is a small constant. Also, impose that at the specific time, the particle must be at a point where the electric field has a particular value, and require finding the ratio of the position coordinates. Additionally, introduce a constraint that the initial velocity must satisfy for the motion to close after one cycle, linking $v_0$ to $E_0$ via an equation derived from the periodicity.", "rewritten_problem": "A particle of mass $m$ and charge $q$ is launched from the origin with initial velocity $\\mathbf{v} = (v_0, 0, 0)$. It moves in a uniform magnetic field $\\mathbf{B} = (0, 0, B)$ and an electric field $\\mathbf{E} = (0, E_0 (1 + \\alpha y^2), 0)$, where $\\alpha$ is a positive constant. It is observed that at time $T = \\frac{2\\pi m}{qB}$, the particle returns to the $x$-$y$ plane. Find the ratio $v_0 / \\sqrt{E_0 / |\\alpha|}$ at the moment when the $x$-component of the velocity becomes zero for the first time after $t=0$, provided that $\\alpha m v_0^2 = q E_0$."}
{"id": 5, "final_score": 8.7, "question": "Two particles of rest masses $m$ and $M$ are attached to the ends of a massless spring with natural length $L$. The spring force is $F = k \\Delta L + \\alpha (\\Delta L)^2$, where $\\alpha = \\frac{k}{c^2} (m + M)$, and $\\Delta L$ is the extension beyond natural length. The system lies on a frictionless horizontal surface. Initially, the spring is relaxed and both particles are at rest. At time $t=0$, an impulse of magnitude $J$ is applied to the mass $m$ in a direction perpendicular to the spring. Find the maximum value of $\\Delta L$ during the motion. Give your answer as a closed-form expression.", "problem_draft": "Two particles of masses $m$ and $M$ are attached to the ends of a light spring of natural length $L$ and spring constant $k$. The system is placed on a horizontal frictionless table. Initially, the spring is at its natural length and the particles are at rest. At $t=0$, the particle of mass $m$ is given an impulse $J$ perpendicular to the spring. Determine the maximum relative extension $\\delta L$ of the spring during the subsequent motion.", "element_idendified": "Key elements: masses $m$ and $M$, spring constant $k$, natural length $L$, initial impulse $J$. Conditions: frictionless, horizontal, initial spring uncompressed, particles initially at rest. Actions: impulse $J$ given to mass $m$ perpendicular to spring axis. Theme: conservation laws and oscillatory motion.", "plan": "1. Add more real-world constraint: consider relativistic effects when velocities are high. Specifically, set the impulse $J$ to be large enough that the kinetic energy is comparable to the rest mass energy of the lighter particle, requiring special relativity. \n2. Increase complexity by making the spring massless but having a nonlinear force law: $F = k \\delta L + \\alpha (\\delta L)^2$, where $\\alpha$ is a constant.\n3. Introduce dependency: the constant $\\alpha$ is related to the rest masses by $\\alpha = \\frac{k}{c^2}(m + M)$, to ensure it arises naturally from relativistic considerations. \n4. Ensure all components are interconnected: the impulse $J$ causes relativistic speeds, necessitating relativistic mechanics, and the nonlinear spring accounts for potential energy corrections. The problem will require conservation of relativistic energy and momentum, and solving the equation for maximum extension must account for the nonlinear spring.\n5. The final answer must be a closed-form expression for $\\delta L$ in terms of $m, M, k, J, L, c$.", "rewritten_problem": "Two particles of rest masses $m$ and $M$ are attached to the ends of a massless spring with natural length $L$ and nonlinear force law $F = k \\delta L + \\alpha (\\delta L)^2$, where $\\alpha = \\frac{k}{c^2}(m + M)$ and $\\delta L$ is the extension. The system is on a horizontal frictionless table. Initially, the spring is at its natural length and both particles are at rest. At $t=0$, the particle of mass $m$ is given an impulse $J$ perpendicular to the spring. Determine the maximum relative extension $\\delta L$ of the spring during the subsequent motion. Express your answer in closed form."}
